{
  "backend/main.mo": "Defines product, variant, and setting types with comparison utilities and initializes a default product catalog in a Motoko actor.",
  "feature_evidence.json": "Contains a feature evidence report linking a header logo size-increase request to the TopNav.tsx component and related metadata.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for various frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Sets global Tailwind base styles and defines extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry file that mounts the React app and loads main.tsx as a module script.",
  "frontend/src/App.tsx": "Configures TanStack Router with root, landing, and shop routes wrapped in the SiteLayout component.",
  "frontend/src/components/landing/CropsHero.tsx": "Canvas-based animated hero section rendering a swaying crops effect with text overlays.",
  "frontend/src/components/landing/ScrollRevealJumbo.tsx": "Scroll-driven reveal component that animates opacity, scale, and position of the Jumbo product section.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the global layout including TopNav, routed page content, and a detailed footer with branding links.",
  "frontend/src/components/nav/TopNav.tsx": "Sticky navigation bar with an enlarged logo, page navigation buttons, and a cart item count badge.",
  "frontend/src/components/shop/CartSummary.tsx": "Displays cart items, totals, and actions to clear the cart or proceed to checkout.",
  "frontend/src/components/shop/ProductCard.tsx": "Renders product details with image, price, specs, and controls to add or remove items from the cart.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity management using AuthClient.",
  "frontend/src/hooks/useProducts.ts": "Fetches product list from the backend actor using react-query.",
  "frontend/src/hooks/useScrollProgress.ts": "Calculates scroll progress for a referenced container based on viewport position.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom color variables, animations, and global layout behavior.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero, feature highlights, and a CTA to navigate to the shop.",
  "frontend/src/pages/ShopPage.tsx": "Displays product grid with loading and error states and a sticky cart summary.",
  "frontend/src/store/cart.ts": "Defines a persisted Zustand store for cart items with add, remove, clear, quantity lookup, total items, and total price utilities.",
  "frontend/tailwind.config.js": "Tailwind configuration extending typography, colors, fonts, animations, and container settings for the project's styling.",
  "project_state.json": "Describes the project’s state, features, and known issues for a pesticide company website with animations and a shopping page."
}